["Below is a detailed document that explains the Kellgren–Lawrence (KL) grading system for osteoarthritis (OA) by breaking down each grade (0 through 4). This document includes descriptions of the radiographic findings, clinical correlations, and general implications for each grade. You can use or adapt this document as a default prompt data set for your OA bot.", "Detailed Document for Each Kellgren–Lawrence (KL) Score for Osteoarthritis", "Introduction", "The Kellgren–Lawrence (KL) grading system is one of the most widely used radiographic classification methods for osteoarthritis. Originally described in 1957, it uses plain radiographs (typically anteroposterior views of the knee or other joints) to assign one of five grades (0–4) reflecting the severity of joint degeneration. Radiographic features—such as joint space narrowing, osteophyte formation, subchondral sclerosis, and bone-end deformity—correlate with increasing disease severity. Although the system was designed for epidemiological studies and clinical trials, it remains a useful tool in guiding clinical decision-making.", "Below is a breakdown of each KL grade.", "KL Grade 0 – Normal", "Radiographic Features\n\t•\tDefinition: No radiographic features of osteoarthritis.\n\t•\tFindings:\n\t•\tNormal joint space.\n\t•\tAbsence of osteophytes (bone spurs).\n\t•\tNo subchondral sclerosis or cyst formation.", "Clinical Correlation\n\t•\tSymptoms: Patients are typically asymptomatic with no OA-related pain or stiffness.\n\t•\tImplications: Radiographs are normal, and any joint pain would prompt further investigation for non-degenerative causes.", "Management\n\t•\tApproach: No specific OA treatment is indicated. Preventative advice regarding joint health (e.g., maintaining a healthy weight and regular exercise) can be recommended.", "Reference:  ￼;  ￼", "KL Grade 1 – Doubtful", "Radiographic Features\n\t•\tDefinition: Doubtful joint space narrowing and possible osteophytic lipping.\n\t•\tFindings:\n\t•\tJoint space appears normal or shows minimal narrowing.\n\t•\tVery small or “doubtful” osteophytes may be present.\n\t•\tNo definite subchondral sclerosis or bone deformity.", "Clinical Correlation\n\t•\tSymptoms: Patients might be asymptomatic or have very mild discomfort. The changes are subtle.\n\t•\tImplications: This grade suggests the earliest signs of degenerative change, but the clinical significance is often limited. It may be considered “doubtful” OA.", "Management\n\t•\tApproach: Monitoring is typically recommended. Lifestyle modifications (e.g., weight management and exercise) can be advised to prevent progression.\n\t•\tFollow-Up: Repeat radiographs over time may be used to assess progression if symptoms develop.", "Reference:  ￼;  ￼", "KL Grade 2 – Mild", "Radiographic Features\n\t•\tDefinition: Definite osteophyte formation with possible joint space narrowing.\n\t•\tFindings:\n\t•\tClear osteophytes (bone spurs) are visible at the joint margins.\n\t•\tJoint space narrowing may be present, though not always pronounced.\n\t•\tSubchondral sclerosis is typically minimal or absent.\n\t•\tBone contour remains mostly preserved.", "Clinical Correlation\n\t•\tSymptoms: Patients may start experiencing intermittent joint pain or stiffness, especially after activity.\n\t•\tImplications: KL Grade 2 represents early osteoarthritis with definite structural changes. It often correlates with the beginning of symptomatic OA in some individuals.", "Management\n\t•\tApproach: Conservative treatment is recommended—lifestyle modifications, physical therapy, and nonsteroidal anti-inflammatory drugs (NSAIDs) may be useful.\n\t•\tGoals: The focus is on symptom relief and delaying further progression.", "*Reference:  ￼; *", "KL Grade 3 – Moderate", "Radiographic Features\n\t•\tDefinition: Moderate multiple osteophytes, definite joint space narrowing, some sclerosis, and possible deformity of bone ends.\n\t•\tFindings:\n\t•\tNumerous osteophytes are present.\n\t•\tClear and definite narrowing of the joint space.\n\t•\tSubchondral sclerosis (increased bone density beneath the cartilage) is evident.\n\t•\tEarly signs of bone-end deformity may appear.", "Clinical Correlation\n\t•\tSymptoms: Patients typically report persistent joint pain, stiffness (especially after periods of inactivity), and reduced range of motion.\n\t•\tImplications: This grade often corresponds to clinically significant OA with moderate functional impairment. There is a more noticeable impact on daily activities.", "Management\n\t•\tApproach: In addition to conservative treatments (exercise, weight reduction, pain medications), interventions such as physical therapy and possibly intra-articular injections (e.g., corticosteroids) may be considered.\n\t•\tGoals: The aim is to improve joint function, relieve pain, and slow progression to more severe changes.", "Reference:  ￼;  ￼", "KL Grade 4 – Severe", "Radiographic Features\n\t•\tDefinition: Large osteophytes, marked narrowing of the joint space, severe sclerosis, and definite deformity of bone ends.\n\t•\tFindings:\n\t•\tExtensive and large osteophyte formation.\n\t•\tMarked and often near-complete loss of joint space (sometimes described as “bone-on-bone” contact).\n\t•\tSevere subchondral sclerosis.\n\t•\tClear deformity of the bone ends.", "Clinical Correlation\n\t•\tSymptoms: Patients frequently experience severe and constant pain, significant stiffness, and considerable functional impairment. Daily activities are usually affected.\n\t•\tImplications: This stage represents end-stage OA where structural damage is extensive. It is typically associated with advanced symptoms and may prompt consideration of surgical intervention.", "Management\n\t•\tApproach: When severe OA is present, conservative treatments may no longer provide sufficient relief. Options include joint replacement surgery (e.g., total knee arthroplasty) and other advanced interventions.\n\t•\tGoals: The focus is on restoring function and relieving pain, as well as improving quality of life.", "This serious, painful condition is the most common form of arthritis and can affect any joint.", "Osteoarthritis is a degenerative joint disease that can affect the many tissues of the joint. It is by far the most common form of arthritis, affecting more than 32.5 million adults in the United States, according to the Centers for Disease Control and Prevention.", "Historically, osteoarthritis (OA) was known as a “wear and tear” condition, generally associated with aging. But we know now that it is a disease of the entire joint, including bone, cartilage, ligaments, fat and the tissues lining the joint (the synovium). Osteoarthritis can degrade cartilage, change bone shape and cause inflammation, resulting in pain, stiffness and loss of mobility.", "OA can affect any joint, but typically affects hands, knees, hips, lower back and neck. Its signs and symptoms typically show up more often in individuals over age 50, but OA can affect much younger people, too, especially those who have had a prior joint injury, such as a torn ACL or meniscus. It typically develops slowly over time, but after such an injury, it can develop much more rapidly, within just a few years. OA is not an inevitable aging disease; some people never develop it.", "There is no cure for OA, but there are ways to manage OA to minimize pain, continue physical activities, maintain a good quality of life and remain mobile.", "Causes", "Factors that may contribute to the development of OA include", "Age. The risk of developing OA increases with age and symptoms generally, but not always, appear in people over 50. \nJoint injury. A bone fracture or cartilage or ligament tear can lead to OA, sometimes more quickly than in cases where there is not an obvious injury.\nOveruse. Using the same joints over and over in a job or sport can result in OA.\nObesity. Excess weight adds stress and pressure on a joint, plus fats cells promote inflammation.\nMusculoskeletal abnormalities. Malalignment of bone or joint structures can contribute to faster development of OA.\nWeak muscles. If muscles don’t provide adequate joint support, poor alignment can result, which can lead to OA.\nGenetics. People with family members who have OA are more likely to develop it.\nGender. Women are more likely to develop OA than men.\nEnvironmental Factors. Modifiable environmental risk factors include things like someone’s occupation, level of physical activity, quadriceps strength, presence or absence of prior joint injury, obesity, diet, sex hormones, and bone density.\nSymptoms", "Symptoms tend to build over time rather than show up suddenly. They include", "Pain or aching in a joint during activity, after long activity or at the end of the day.\nJoint stiffness usually occurs first thing in the morning or after resting.\nLimited range of motion that may go away after movement.\nClicking or popping sound when a joint bends.\nSwelling around a joint.\nMuscle weakness around the joint.\nJoint instability or buckling (as when a knee gives out).\nOA may affect different parts of the body in different ways.", "Hips. Pain in the groin area or buttocks and sometimes on the inside of the knee or thigh.\nKnees. A “grating” or “scraping” feeling when moving the knee. \nFingers. Bony growths (spurs) at the edge of joints can cause fingers to become swollen, tender and red, sometimes with pain at the base of the thumb.\nFeet. Pain and tenderness in the big toe, with possible swelling in the ankles or toes.\nPotential Consequences", "Pain, reduced mobility, side effects from medications and other factors associated with osteoarthritis can lead to health complications that are not caused by the disease itself.", "Obesity, Diabetes and Heart Disease", "Painful joints, especially in the feet, ankles, knees, hip or back, make it harder to exercise. But physical activity is not only key to managing OA symptoms, it also can help prevent weight gain, which can lead to obesity. Being overweight or obese can lead to the development of high cholesterol, type 2 diabetes, heart disease and high blood pressure.", "Falls", "Research indicates people with OA experience more falls and risk of fracture than those without OA. Although study results vary, some research shows they may have up to 30% more falls and have a 20% greater risk of fracture. Having OA can decrease function, weaken muscles, affect overall balance, and make falls more likely, especially among those with OA in knees or hips. Side effects from pain medications, such as dizziness, can also contribute to falls.", "Support vital advocacy, research and programs for the nearly 60 million people in America living with arthritis.", "Give to support the 1 in 4 adults and hundreds of thousands of children in America who live with painful and often debilitating arthritis.", "Diagnosis", "Medical history, a physical examination and lab tests help to make up the OA diagnosis.", "A primary care doctor may be the first person you talk to about joint pain. The doctor will review your medical history, symptoms, how the pain affects activities, as well as your medical problems and medication use. He or she will also look at and move your joints, and may order imaging. These tests help to make the diagnosis:", "Joint aspiration. After numbing the area, a needle is inserted into the joint to pull out fluid. This test will look for infection or crystals in the fluid to help rule out other medical conditions or other forms of arthritis.\nX-ray. X-rays can show joint or bone damage or changes related to osteoarthritis.\nMRI. Magnetic resonance imaging (MRI) gives a better view of cartilage and other parts of the joint.\nTreatment", "There is no cure for OA, but medication, assistive devices and other therapies that don’t involve drugs can help to ease pain. As a last resort, a damaged joint may be surgically fused or replaced with one made of a combination of metal, plastic and/or ceramic.", "Medications", "Pain and anti-inflammatory medicines for osteoarthritis are available as pills, syrups, patches, gels, creams or injectables. They include:", "Analgesics. These are pain relievers and include acetaminophen and opioids. Acetaminophen is available over the counter (OTC); opioids must be prescribed by a doctor.\nNonsteroidal anti-inflammatory drugs (NSAIDs). These are the most commonly used drugs to ease inflammation and pain. They include aspirin, ibuprofen, naproxen and celecoxib, available either OTC or by prescription. The OTC versions help with pain but not inflammation.\nCounterirritants. These OTC products contain ingredients like capsaicin, menthol and lidocaine that irritate nerve endings, so the painful area feels cold, warm or itchy to take focus away from the actual pain. \nCorticosteroids. These prescription anti-inflammatory medicines work in a similar way to a hormone called cortisol. The medicine is taken by mouth or injected into the joint at a doctor’s office.\nPlatelet-rich plasma (PRP). Available from a doctor by injection, this product is intended to help ease pain and inflammation. This is not approved by the Food & Drug Administration and evidence is still emerging, so discuss it with your doctor before trying it.\nOther drugs. The antidepressant duloxetine (Cymbalta) and the anti-seizure drug pregabalin (Lyrica) are oral medicines that are FDA-approved to treat OA pain.\nNondrug Therapies", "Exercise", "Movement is an essential part of an OA treatment plan. Getting 150 minutes of moderate-to-vigorous exercise per week should be the goal, according to the U.S. Department of Health and Human Services. A good exercise program to fight OA pain and stiffness has four parts:", "Strengthening exercises build muscles around painful joints and helps to ease the stress on them. \nRange-of-motion exercise or stretching helps to reduce stiffness and keep joints moving.\nAerobic or cardio exercises help improve stamina and energy levels and reduce excess weight.\nBalance exercises help strengthen small muscles around the knees and ankles and help prevent falls.\nTalk to a doctor or physical therapist before starting a new exercise program.", "Weight Loss", "Excess weight puts additional force and stress on weight-bearing joints, including the hips, knees, ankles, feet and back, and fat cells promote inflammation. Losing extra weight helps reduce pain and slow joint damage. Every pound of weight lost removes four pounds of pressure on lower-body joints.", "Physical Therapies and Assistive Devices\nPhysical therapists, occupational therapists and chiropractors can provide:", "Specific exercises to help stabilize your joints and ease pain.\nInformation about natural treatments and products that can ease pain.\nInstruction to make movement easier and to protect joints. \nBraces, shoe inserts or other assistive devices.\nSurgery", "Joint surgery can improve pain and function. Joint replacement surgery replaces damaged joints to restore mobility and relieve pain. Hips and knees are the joints most commonly replaced. An orthopedic surgeon can determine the best procedure based on how badly damaged the joint is.", "Self-Care", "Practicing these habits can slow down OA, keep you healthier overall and delay surgery as long as possible. It is important to pursue a number of different self-care approaches simultaneously. They are listed below.", "Maintain a Healthy Weight", "Excess weight worsens OA. Combine healthy eating with regular exercise to maintain a healthy weight.", "Control Blood Sugar", "Many people have diabetes and OA. Having high glucose levels can make cartilage stiffer and more likely to break down. Having diabetes causes inflammation, which also weakens cartilage.", "Maintain Range of Motion", "Movement is medicine for joints. Make a habit of putting your joints through their full range of motion, but only up to the point where it doesn’t cause more pain. Gentle stretching, raising and lowering legs from a standing or seated position, daily walks and hobbies such as gardening can help. But listen to your body and never push too hard.", "Protect Joints", "Make sure to warm up and cool down when doing exercise. If you play sports, protects joints with the right gear. Use your largest, strongest joints for lifting, pushing, pulling and carrying. Watch your step to prevent falls. Balance rest and activity throughout the day.", "Relax", "Find ways to reduce or avoid stress through meditation, listening to music, connecting with friends and family, doing fun activities, and finding ways to relax and recharge.", "Choose a Healthy Lifestyle", "Eating healthy food, balanced nutrition, not smoking, drinking in moderation and getting good sleep will help you to feel your best.", "OA-CTN Investment for Osteoarthritis Research", "The Arthritis Foundation invests in researching disease-modifying drugs for OA.\nRead More\nOA Treatment\nOsteoarthritis", "OA Treatment", "Managing osteoarthritis (OA) pain requires a comprehensive plan. Learn about medications, topicals, injections, assistive devices and surgical options that can help.", "IN BRIEF\nClassifications in Brief\nKellgren-Lawrence Classification of Osteoarthritis\nMark D. Kohn BA, Adam A. Sassoon MD, Navin D. Fernando MD\nReceived: 15 September 2015 / Accepted: 1 February 2016 / Published online: 12 February 2016\n  The Association of Bone and Joint Surgeons1 2016\nHistory\nOsteoarthritis (OA) ranks globally among the 50 most\ncommon sequelae of diseases and injuries, affecting over\n250 million people or 4% of the world’s population [39].\nOf the global disease burden for OA, knee OA constitutes\n83% [39]. A detailed analysis of Medicare beneficiaries\nreported the TKA annual utilization rate ranging from\n287,006 in 2006 to 301,956 in 2010 [26]. The demand for\nTKA is expected to grow exponentially over the coming\ndecades with epidemiological data suggesting a 673%\nincrease in the United States by 2030, representing 3.48\nmillion procedures annually [22].\nAs a polymorphic disease with a variety of clinical\npresentations, OA is challenging to rigorously define. A\ncommonly encountered definition of OA describes ‘‘…a\nheterogeneous group of conditions that leads to joint\nsymptoms and signs which are associated with defective\nintegrity of articular cartilage, in addition to related\nchanges in the underlying bone and at the joint margins’’\n[1]. The pathogenesis of OA is poorly understood but is\nthought to include a complex interplay among mechanical,\nbiochemical, cellular, genetic, and immunologic phenomena\n[7]. Several attempts to develop diagnostic criteria for\nOA were previously undertaken and incorporate patientreported\njoint pain in conjunction with consistent radiographic\nfindings [1, 6, 24]. OA generally can be\nsubcategorized into primary (idiopathic) and secondary OA\n[1, 25]. Common causes of secondary OA include posttraumatic,\ndysplastic, infectious, inflammatory, or\nbiochemical etiologies that are relatively well understood.\nAlthough the etiology of primary OA remains largely\nundefined, genetic factors, age-related physiological\nchanges, ethnicity, and biomechanical factors likely play\nan important role [16].\nPlain radiography remains a mainstay in the diagnosis of\nOA. The first formalized attempts at establishing a radiographic\nclassification scheme for OA were described by\nKellgren and Lawrence (KL) in 1957 [19]. After studying\nrheumatism in coal miners at the Bedford Colliery in North\nWest England [18], Kellgren investigated the inter- and\nintraobserver reliability of radiographic changes of\nrheumatism observed in the hand [17]. After concluding\nthat there was wide disagreement among different observers,\nKL endeavored to establish a classification\nscheme with an associated set of standardized radiographs\nfor OA of diarthrodial joints. They proposed a five-grade\nclassification scheme and examined plain radiographs of\neight joints including the distal interphalangeal joint (DIP),\nmetacarpophalangeal joint (MCP), first carpometacarpal\njoint (CMC), wrist, cervical spine, lumbar spine, hips, and\nknees to calculate the inter- and intraobserver reliability of\neach [19]. They found that the tibiofemoral joint of the\nknee had the highest interobserver correlation coefficient of\nr = 0.83 (range of all joints studied, 0.10–0.83) as well as\nthe second highest intraobserver correlation coefficient of\nEach author certifies that he or she, or a member of his or her\nimmediate family, has no funding or commercial associations (eg,\nconsultancies, stock ownership, equity interest, patent/licensing\narrangements, etc) that might pose a conflict of interest in connection\nwith the submitted article.\nAll ICMJE Conflict of Interest Forms for authors and Clinical\nOrthopaedics and Related Research1 editors and board members are\non file with the publication and can be viewed on request.\nM. D. Kohn, A. A. Sassoon, N. D. Fernando (&)\nUniversity of Washington, 10330 Meridian Avenue N, Suite 270,\nSeattle, WA 98133, USA\ne-mail: navinf@uw.edu\n123\nClin Orthop Relat Res (2016) 474:1886–1893\nDOI 10.1007/s11999-016-4732-4\nClinicalOrthopaedics\nand Related Research®\nA Publication of The Association of Bone and Joint Surgeons®\nr = 0.83 (range of all joints studied, 0.42–0.88) among the\ndiarthrodial joints they examined [19]. These early results\nwould predict the future application of their classification\nscheme to the knee specifically. Currently, the KL classification\nis the most widely used clinical tool for the\nradiographic diagnosis of OA [5].\nPurpose\nThe KL classification has been commonly used as a research\ntool in epidemiological studies of OA, including landmark\narticles by Felson et al. [10] in the Framingham\nOsteoarthritis Study, and Bagge et al. [3] assessing\nosteoarthritis in European populations. The KL classification\nwas also used in the development of atlases of radiographic\nfeatures of OA, including the work done by Scott et al. [33].\nThe Kellgren and Lawrence classification may also\nassist healthcare providers with a treatment algorithm to\nguide clinical decision-making, specifically defining which\npatients may benefit most from surgical management.\nFurthermore, some insurers currently require providers to\ninclude documentation of the KL classification to receive\napproval for a TKA [37, 38].\nDespite its common use, all research and clinical efforts\nusing the KL classification depend critically on rigorous\nvalidation and continuous reevaluation of the schema’s\nrelevance to patient-centered outcomes.\nDescription of the Kellgren-Lawrence Classification\nSystem\nBased on the data presented in their original work, the KL\nclassification is typically applied specifically within the context\nof knee OA. The KL classification was originally\ndescribed using AP knee radiographs. Each radiograph was\nassigned a grade from 0 to 4, which they correlated to\nincreasing severity of OA, with Grade 0 signifying no presence\nof OA and Grade 4 signifying severe OA [19] (Fig. 1).\nAdditionally, KL provided detailed radiographic descriptions\nofOA(Table 1).Although it is unclear fromthe original paper\nwhether the radiographic descriptionswere presentedwith the\nintent of demonstrating a linear disease progression ofOAthat\nbegins with the formation of osteophytes and culminates in the\naltered shape of bone ends, other authors have criticized the\nKL system on the basis of this assumption [5, 27].\nValidation\nIn their original paper, KL acknowledged variability in the\nradiographic evaluation of OA and described the inter- and\nintraobserver reliability of their system [19] (Table 2). In\nparticular, the authors comment that estimates of OA\nprevalence in all joints examined vary considerably\nbetween observers (± 31% deviation from the mean\nnumber of diagnoses of OA) and less so within the same\nobserver (± 5% deviation from the mean number of\ndiagnoses of OA). The authors report the inter- and\nintraobserver reliability correlation coefficient of the knee\nto both be 0.83 and comment that, ‘‘A significant correlation\nbetween the two observers was obtained for all joints\nexcept the wrist’’ and ‘‘Two readings by the same observer\ngave only a slightly better correlation on the reading of\nindividual x rays…’’ [19]. It is unlikely, however, that the\nauthors used the term ‘‘significant’’ within the same statistical\ncontext that the word carries in the literature today\nbecause no p values or confidence intervals were reported\nfor their data. To determine the inter- and intraobserver\ncorrelation coefficients, KL used two observers to evaluate\na series of 510 radiographs of eight joints including the\nDIP, MCP, first CMC, wrist, cervical spine, lumbar spine,\nhips, and knees from 85 patients aged 55 to 64 years\nselected randomly from an urban population. The authors\ndid not explicitly report how many radiographs from each\njoint were used in their calculations or mention the qualifications\nor training of the two observers who graded the\nradiographs.\nMore recently, Wright [40] reevaluated the interobserver\nreliability of the KL system in addition to five other\nradiographic classification schemes used to grade knee OA\n(Table 3). The group used radiographs from 632 patients\nenrolled in the Multicenter ACL Revision Study (MARS)\nconsortium, which consisted of cohorts of patients from 83\nsurgeons from 52 sites. The investigators used three independent\nand blinded observers (specific qualifications and\ntraining not explicitly stated by authors) to grade weightbearing\nAP and/or Rosenberg radiographs (depending on\navailability) with six radiographic classification schemes.\nIn addition, their radiographic findings were compared with\narthroscopic evidence of tibiofemoral chondral disease.\nThey reported that the KL system was the most studied\namong the different classification systems and had an\ninterobserver reliability intraclass correlation coefficient of\n0.51 to 0.89 (considered ‘‘moderate’’ to ‘‘very good’’ based\non the author’s provided definitions) from studies since the\noriginal KL article [40]. The investigators provided their\nown interobserver reliability intraclass correlation coefficients\nusing the Rosenberg radiograph 0.54 (95%\nconfidence interval [CI], 0.48–0.59) and AP radiographs\n0.38 (95% CI, 0.33–0.43), which they characterized as\nmoderate and poor, respectively [40]. The authors provide\nan explanation for this wide range in interobserver reliability\nby suggesting that differences in technique,\npopulation age group, and degree of OA likely contributed\nVolume 474, Number 8, August 2016 Classifications in Brief 1887\n123\nto the differing results from the various studies. It is also\nlikely that variable interpretations of the KL classification\nby observers in different studies had a considerable effect\non the reliability data they reported.\nIn the 1987 study of the Framingham population by\nFelson et al. [10], the investigators had two academically\nbased bone and joint radiologists examine standing AP\nTable 1. Radiologic features of osteoarthritis as described by Kellgren\nand Lawrence [19]\nFormation of osteophytes on joint margin or on the tibial spines\nPeriarticular ossicles (primarily with regard to DIP and PIP joints)\nNarrowing of joint cartilage associated with sclerosis of subchondral\nbone\nSmall pseudocystic areas with sclerotic walls situated usually in the\nsubchondral bone\nAltered shape of bone ends, particularly in the head of the femur\nModified with permission from Kellgren JH, Lawrence JS. Radiological\nassessment of osteo-arthrosis. Ann Rheum Dis. 1957;16:494–\n502. DIP = distal interphalangeal; PIP = posterior interphalangeal.\nTable 2. Inter- and intraobserver correlation coefficients of the\nKellgren and Lawrence classification in various joints [19]\nJoint examined Interobserver\ncorrelation\ncoefficient (r)\nIntraobserver\ncorrelation\ncoefficient (r)\nFirst carpometacarpal joint 0.78 0.81\nWrist 0.10 0.62\nCervical spine 0.57 0.66\nDorsolumbar spine 0.52 0.42\nHips 0.40 0.75\nKnees 0.83 0.83\nMetacarpophalangeal Not done 0.88\nModified with permission from Kellgren JH, Lawrence JS. Radiological\nassessment of osteo-arthrosis. Ann Rheum Dis. 1957;16:494–502.\nFig. 1A–D AP radiographs of the knee presented in the original\nKellgren-Lawrence article [19]. (A) Representative knee radiograph\nof KL classification Grade 1, which demonstrates doubtful narrowing\nof the joint space with possible osteophyte formation. (B) Representative\nknee radiograph of KL classification Grade 2, which\ndemonstrates possible narrowing of the joint space with definite\nosteophyte formation. (C) Representative knee radiograph of KL\nclassification Grade 3, which demonstrates definite narrowing of joint\nspace, moderate osteophyte formation, some sclerosis, and possible\ndeformity of bony ends. (D) Representative knee radiograph of KL\nclassification Grade 4, which demonstrates large osteophyte formation,\nsevere narrowing of the joint space with marked sclerosis, and\ndefinite deformity of bone ends. Reprinted with permission from\nKellgren JH, Lawrence JS. Radiological assessment of osteo-arthrosis.\nAnn Rheum Dis. 1957;16:494–502.\n1888 Kohn et al. Clinical Orthopaedics and Related Research1\n123\nTable 3. Grading scales for the radiographic osteoarthritis classification systems [40]\nScale Grade and characteristics\nKellgren-\nLawrence\n[19, 30]\n0: No JSN or reactive changes 1: Doubtful JSN, possible\nosteophytic lipping\n2: Definite osteophytes, possible\nJSN\n3: Moderate osteophytes, definite\nJSN, some sclerosis, possible\nbone-end deformity\n4: Large osteophytes, marked\nJSN, severe sclerosis,\ndefinite bone ends deformity\nIKDC\n[14, 15]\nA: No JSN* B:[4-mm joint space; small\nosteophytes, slight sclerosis, or\nfemoral condyle flattening\nC: 2- to 4-mm joint space D:\\2-mm joint space\nFairbank\n[9, 36]\n0: Normal 1: Squaring of tibial margin 2: Flattening of femoral condyle,\nsquaring and sclerosis of tibial\nmargin\n3: JSN, hypertrophic changes, or\nboth\n4:[75% JSN with secondary\nfeature\nBrandt et al.\n[4]\n0:\\25% JSN without secondary\nfeatures (subchondral sclerosis,\ngeodes, and osteophytes)\n1:\\25% JSN with secondary\nfeatures of 25%–50% JSN\nwithout secondary features\n2: 25%–50% JSN with secondary\nfeatures or 50%–75% JSN\nwithout secondary features\n3: 50%–75% JSN with secondary\nfeatures or[75% JSN without\nsecondary features\n4:[75% JSN with secondary\nfeatures\nAhlba¨ck\n[11]\n0: Normal 1: JSN  (with or without\nsubchondral sclerosis)\n2: Obliteration of joint space 3: Bone defect/loss\\5 mm 4: Bone defect and/or loss 5–10\nmm\nJa¨ger-Wirth\n[29, 32]\n0: No arthrosis 1: Initial arthrosis, small\nosteophytes, minimal JSN\n2: Moderate arthrosis,\napproximately 50% JSN\n3: Medium-grade arthrosis 4: Heavy arthrosis\nReprinted with permission from Wright RW. Osteoarthritis classification scales: interobserver reliability and arthroscopic correlation. J Bone Joint Surg Am. 2014;96:1145–1151; * JSN = joint\nspace narrowing; IKDC = International Knee Documentation Committee;  joint space narrowing is\\3 mm of the joint space or\\50% of the other compartment.\nVolume 474, Number 8, August 2016 Classifications in Brief 1889\n123\nradiographs of the knee of 1424 elderly patients (ages 63–\n94 years old, mean = 73 years) and reported an interrater\nintraclass correlation coefficient of 0.85 (‘‘very good’’)\nusing the KL classification. Although the study provided\nunique population-based data using highly trained observers,\nthe authors admit that their population lacked ethnic\ndiversity by having no black, Hispanic, or non-European\nethnic groups. Given the growing ethnic diversity of the US\npopulation, it may be difficult to extrapolate the results\nfound in this study to the broader population. In later works\nby Scott et al. [33], the authors used two skeletal radiologists\nand two rheumatologists to examine 30 standing AP\nknee radiographs randomly selected by an investigator not\ninvolved in the readings from the Baltimore Longitudinal\nStudy of Aging and reported an interreader intraclass correlation\ncoefficient of 0.68 (‘‘good’’) and intrareader\nintraclass correlation coefficient of 0.87 (‘‘very good’’).\nThe authors do not provide detailed ethnic demographic\ninformation about their study population but report that\ntheir subjects consisted of 25 men and five women (ages\n42–84 years old, mean age of men = 67 years, mean age of\nwomen = 71 years). Both studies admit to selecting a\nsimilar number of radiographs from each KL classification\ngrade for calculating their intraclass correlation coefficients,\nwhich may provide more stable predictions of\nreliability scores but may not be as readily applicable to\nlarger populations. Another study by Gossec et al. [12]\nused 50 radiographs selected from 1759 radiographs from\nfive databases of trials or cohort studies to evaluate the\ninterreader and intrareader intraclass correlation coefficient\nof standing, extended knee radiographs using two trained\nrheumatologists and reported that the KL classification had\nan interreader intraclass correlation coefficient of 0.72\n(95% CI, 0.38–0.86) (‘‘good’’) and an intrareader intraclass\ncorrelation coefficient of 0.72 (95% CI, 0.55–0.83)\n(‘‘good’’). No criteria for the selection of the 50 radiographs\nfrom the collection of 1759 were explicitly stated by\nthe authors and it is not clear if the selection included\nrelatively equal numbers of radiographs from each KL\nclassification grade. Given the differing demographic\nmakeup of each population studied, including differences\nin ethnic group, percentage of male versus female, and age\nas well as the differing selection criteria for the radiographs\nexamined by the observers, which themselves varied in\nnumber, qualifications, and training, it is understandable\nthat the range of interobserver intraclass correlation coefficients\nfor the KL classification cited by Wright [40]\n(0.51–0.89) is as wide as it is.\nAlthough independent validation of the KL classification\nhas been examined by multiple authors, less is known\nabout the KL classification’s diagnostic accuracy, that is\nthe degree to which the radiographic findings actually\nreflect the physical state of the joint; the best work on this\nsuggests that using the Rosenberg view (the 45  posteroanterior\nflexion weightbearing radiograph; Fig. 2 [28])\nresults in higher interrater reliability (0.54; 95% CI, 0.48–\n0.59) and better correlation to arthroscopic evidence of OA\n(Spearman rho 0.42; 95% CI, 0.33–0.49) than does using\nthe AP radiograph (interrater reliability 0.38; 95% CI,\n0.33–0.43; Spearman rho 0.30; 95% CI, 0.23–0.38) [40].\nThose authors argue that this may be because the Rosenberg\nradiograph provides better visualization of the femoral\ncondyles in midflexion, a common site of articular surface\ndegeneration.\nLimitations\nDespite the wide application of the KL classification, the\nsystem has several noted limitations. Perhaps the most\nwidely argued criticism of the KL system is its application\nto disease progression and insensitivity to change. The KL\nsystem has been criticized by Spector and Cooper [35] for\nassuming a linear radiographic progression of OA, starting\nwith osteophyte formation, proceeding to joint space narrowing\n(JSN), and terminating in deformation of articular\nsurfaces. However, as the authors point out, JSN in the\nabsence of osteophyte formation cannot be measured in the\nKL system, which becomes problematic in patients with\nFig. 2 Diagram of how the Rosenberg radiograph would be set up\nand performed [28]. Reprinted with permission from Rosenberg TD,\nPaulos LE, Parker RD, Coward DB, Scott SM. The forty-five-degree\nposteroanterior flexion weight-bearing radiograph of the knee. J Bone\nJoint Surg Am. 1988;70:1479–1483.\n1890 Kohn et al. Clinical Orthopaedics and Related Research1\n123\nknee pain and radiographically evident loss of cartilage but\na lack of osteophytes on their knee radiographs. Although\nthis occurrence is thought to be less common, the presence\nof marginal osteophytes likely represents a hypertrophic\nresponse to mechanical stress in conjunction with\nenchondral ossification, which may occur along a spectrum\ndepending on individual physiology [21]. Other classification\nsystems have attempted to segregate the radiological\nfindings by performing individual evaluations of the joint\nspace for the medial and lateral compartments separately\nand doing likewise again for osteophyte formation in each\nlocation [2, 5, 27, 34]. However, these classification systems\nhave not been adopted widely, likely as a result of\nchallenges in standardizing definitions and an inherent\ndifficulty in discriminating JSN and osteophyte formation.\nIn addition, Gu¨nther and Sun [13] described inferior\ninterobserver intraclass correlation coefficients for medial\ncompartment (0.62) and lateral compartment (0.47) JSN as\nwell as medial femorotibial, lateral femorotibial, and tibial\nspine osteophyte formation (0.75, 0.74, and 0.63, respectively)\nas compared with the overall KL classification score\n(0.81) when using three observers, one of whom was an\nexperienced orthopaedic surgeon and two of whom were\northopaedic residents. As discussed by Emrani et al. [8],\nclassifications based on JSN may be preferable to the KL\nsystem for monitoring progression of OA, whereas the KL\nsystem may be better for assessing severity of osteoarthritic\ndisease. A criticism of multiple classification systems (including\nthe KL) is the lack of recognition of patellofemoral\narthritis as a distinct or contributory radiographic factor.\nAnother criticism of the KL system is the inconsistency\nin its original description by the authors and variable\napplications of the classification in subsequent studies. In\ntheir original paper, KL provided simple descriptions of\neach grade, ‘‘none, doubtful, minimal, moderate, severe,’’\nalong with radiographic features considered evidence of\nOA [19] (Table 1); however, they never explicitly specified\nwhich radiographic features correspond to which grade.\nYears after their original article, Grade 2 was changed to\n‘‘the presence of definite osteophytes with minimal joint\nspace narrowing’’ [20]. After that, Grade 2 was changed\nagain to ‘‘definite osteophytes but the joint space is\nunimpaired’’ [23]. These conflicting descriptions, although\nthey were not present in the initial paper or made by its\noriginal authors, have nonetheless led to substantial confusion\namong investigators and inconsistent application.\nSchiphof et al. [30] examined epidemiological cohort\nstudies between 1966 and 2006 that incorporated the\noriginal KL criteria and found five different descriptions of\nthe KL grading system. Interestingly, some cohort studies\ncontained inconsistencies within the same article. They\nlater examined the impact of these differences in descriptions\nof the KL criteria [31] by having two trained readers\nexamine the weightbearing, extended, AP knee radiographs\nof 3071 people using the five unique descriptions. The\nauthors calculated reproducibility, agreement using the j\nstatistic, and association with patient-reported knee complaints.\nThey determined that the reproducibility of three of\nthe descriptions was ‘‘good’’ (weighted j = 0.66, 0.69,\n0.63), whereas the reproducibility of the original description\nand a fifth description was ‘‘moderate’’ and ‘‘poor’’\n(weighted j = 0.41 and 0.35, respectively). The authors\ndetermined the agreement between the original KL criteria\nand the four alternatives to be ‘‘moderate’’ (weighted j\napproximately 0.50). The correlation to patient-reported\nknee complaints was the strongest with the original\ndescription (odds ratio [OR], 2.2 [95% CI, 1.9–2.7], 4.3\n[95% CI, 3.2–5.7], 18.3 [95% CI, 7.1–47.2] at Grade[1,\nGrade[2, Grade[3, respectively); however, the differences\nin OR between the original and alternative\ndescriptions were small and sometimes not significant [31].\nAdditionally, the authors admit that patient-reported knee\ncomplaints could be influenced by the presence of patellofemoral\nOA, which is not taken into account with the KL\nsystem and must be contextualized when interpreting this\ndata. The authors conclude their article with recommendations\nfor using the original description to differentiate\npatients categorized as Grade[2 (definite/mild OA) from\npatients categorized as Grade\\2 (none/possible OA) and\nto use several of the alternative descriptions to differentiate\npatients categorize as Grade 0 (no OA) from patients categorized\nas Grade 1 (possible OA). Given these results, it is\nclear that discrepancies in the description and application\nof the KL system are present in the literature; however, the\nexact impact of these differences on patient care is unclear\nand requires further investigation.\nConclusions and Uses\nAlthough the KL system has limitations, it remains widely\nused in clinical practice and in research. Like any radiographic\nclassification tool, the KL system is used ideally in\nconjunction with a thorough clinical assessment. Altman\net al. [1] proposed criteria combining the medical history,\nphysical examination, laboratory as well as radiographic\ntests to diagnose knee OA, an approach that provides a\nmore comprehensive assessment of a patient’s disease state\nin comparison to the KL system alone.\nRadiographic classification systems like KL seek to\nstandardize the interpretation of studies that many clinicians\norder during an initial assessment of a patient\npresenting with clinical findings suggestive of knee OA. In\ntheir original paper, Kellgren and Lawrence intended to\ncreate a standard reference for the radiographic evaluation\nof OA for the purposes of field surveys and clinical trials.\nVolume 474, Number 8, August 2016 Classifications in Brief 1891\n123\nAlthough the KL system has been validated with respect to\ninter- and intraobserver reliability and a recent article\nsuggests high diagnostic accuracy [40], further research\napplications should likely focus on the development of\ntreatment algorithms based on classification grade. Such\nalgorithms may better guide clinical decision-making\nthrough an evidence-based approach.", "Below are seven detailed documents that you can use as reference materials (e.g., for a retrieval‐augmented generation setup) in your OA project. Each document is structured with clear headings and sections, so that your chatbot (or any retrieval system) can return the appropriate context when answering user queries.", "Document 1: General Overview of Osteoarthritis and the KL Grading System", "Introduction\nOsteoarthritis (OA) is a degenerative joint disease characterized by the gradual loss of cartilage, joint space narrowing, and changes in the underlying bone. It is the most common form of arthritis and is a major cause of pain and disability, particularly in older adults.", "The Kellgren–Lawrence (KL) Grading System\nDeveloped in 1957, the KL grading system is widely used to classify the severity of OA based on radiographic findings. It divides OA into five grades (0–4):\n\t•\tKL Grade 0: Normal, with no radiographic features of OA.\n\t•\tKL Grade 1: Doubtful, with subtle changes that might represent the very early onset of OA.\n\t•\tKL Grade 2: Mild, with definite osteophyte formation and possible joint space narrowing.\n\t•\tKL Grade 3: Moderate, with multiple osteophytes, clear joint space narrowing, and subchondral sclerosis.\n\t•\tKL Grade 4: Severe, with large osteophytes, marked joint space loss, severe sclerosis, and bone deformity.", "Clinical Correlations and Implications\nEach KL grade correlates with different clinical presentations—from asymptomatic patients (KL 0) to those with significant pain, stiffness, and functional impairment (KL 3–4). These correlations help guide treatment decisions, ranging from lifestyle modifications in early disease to surgical interventions in advanced cases.", "Management Strategies\nTreatment approaches depend on the severity:\n\t•\tEarly Grades (0–1): Focus on prevention, lifestyle modifications, and exercise.\n\t•\tMild to Moderate OA (KL 2–3): Conservative management including physical therapy, NSAIDs, and intra-articular injections.\n\t•\tSevere OA (KL 4): Advanced interventions, such as joint replacement surgery, may be necessary.", "This document provides a comprehensive overview that sets the stage for understanding the more detailed descriptions in the subsequent documents.", "Document 2: Detailed Document for KL Grade 0 – Normal", "Radiographic Features\n\t•\tDefinition: No radiographic evidence of osteoarthritis.\n\t•\tFindings:\n\t•\tNormal joint space width.\n\t•\tNo osteophyte (bone spur) formation.\n\t•\tAbsence of subchondral sclerosis or cystic changes.", "Clinical Correlation\n\t•\tSymptoms:\n\t•\tPatients typically experience no pain or stiffness related to OA.\n\t•\tImplications:\n\t•\tRadiographs are normal, indicating that any joint discomfort is likely due to other causes.", "Management and Recommendations\n\t•\tPreventative Advice:\n\t•\tEncourage maintaining a healthy weight and regular exercise.\n\t•\tNo specific OA treatment is required.", "Conclusion\nKL Grade 0 indicates a healthy joint appearance on radiographs and suggests that preventive measures can help maintain joint health.", "Document 3: Detailed Document for KL Grade 1 – Doubtful", "Radiographic Features\n\t•\tDefinition: Doubtful changes that may represent early OA.\n\t•\tFindings:\n\t•\tJoint space appears normal or shows minimal narrowing.\n\t•\tPossible presence of very small or “doubtful” osteophytes.\n\t•\tNo definite subchondral sclerosis or bone deformity.", "Clinical Correlation\n\t•\tSymptoms:\n\t•\tPatients may be asymptomatic or report very mild discomfort.\n\t•\tImplications:\n\t•\tThe changes are subtle and may not be clinically significant; however, they could represent the very early stages of degenerative change.", "Management and Recommendations\n\t•\tMonitoring:\n\t•\tRegular follow-up with periodic radiographs can help monitor for progression.\n\t•\tLifestyle Adjustments:\n\t•\tAdvise on weight management, exercise, and joint care practices.\n\t•\tConservative Approach:\n\t•\tNo aggressive treatment is usually required at this stage.", "Conclusion\nKL Grade 1 is often considered “doubtful” OA, indicating subtle radiographic changes with minimal clinical impact, but it should prompt monitoring and preventive lifestyle modifications.", "Document 4: Detailed Document for KL Grade 2 – Mild", "Radiographic Features\n\t•\tDefinition: Definite osteophyte formation with possible joint space narrowing.\n\t•\tFindings:\n\t•\tClear evidence of osteophytes at the joint margins.\n\t•\tJoint space narrowing may be present, though not consistently pronounced.\n\t•\tMinimal or no subchondral sclerosis.\n\t•\tBone contour is mostly preserved.", "Clinical Correlation\n\t•\tSymptoms:\n\t•\tSome patients may start experiencing intermittent joint pain or stiffness, especially after activity.\n\t•\tImplications:\n\t•\tIndicates early osteoarthritis with structural changes that correlate with the onset of symptoms in some individuals.", "Management and Recommendations\n\t•\tConservative Treatment:\n\t•\tEmphasize lifestyle modifications, physical therapy, and pain management with NSAIDs.\n\t•\tMonitoring:\n\t•\tFollow-up assessments may be required to monitor disease progression.\n\t•\tPatient Education:\n\t•\tEducate patients on joint health, activity modification, and weight management.", "Conclusion\nKL Grade 2 represents early, definite OA where structural changes are present. At this stage, conservative treatments can help manage symptoms and potentially slow progression.", "Document 5: Detailed Document for KL Grade 3 – Moderate", "Radiographic Features\n\t•\tDefinition: Moderate osteoarthritic changes with multiple osteophytes and clear joint space narrowing.\n\t•\tFindings:\n\t•\tMultiple and larger osteophytes are present.\n\t•\tDefinite narrowing of the joint space.\n\t•\tSubchondral sclerosis is evident.\n\t•\tEarly signs of bone-end deformity may be observed.", "Clinical Correlation\n\t•\tSymptoms:\n\t•\tPersistent joint pain and stiffness are common.\n\t•\tPatients often report reduced range of motion and functional impairment.\n\t•\tImplications:\n\t•\tThis grade reflects clinically significant OA with noticeable impact on daily activities and quality of life.", "Management and Recommendations\n\t•\tConservative Measures:\n\t•\tPhysical therapy, NSAIDs, and lifestyle modifications remain first-line interventions.\n\t•\tAdditional Interventions:\n\t•\tConsider intra-articular injections (e.g., corticosteroids) for pain relief.\n\t•\tMonitoring and Support:\n\t•\tRegular assessments are necessary to evaluate symptom progression and adjust treatment accordingly.", "Conclusion\nKL Grade 3 indicates moderate OA with significant radiographic and symptomatic changes. Management focuses on relieving symptoms, maintaining joint function, and slowing further degeneration.", "Document 6: Detailed Document for KL Grade 4 – Severe", "Radiographic Features\n\t•\tDefinition: Severe osteoarthritis with extensive radiographic abnormalities.\n\t•\tFindings:\n\t•\tExtensive and large osteophyte formation.\n\t•\tMarked and near‑complete loss of joint space, often described as “bone-on-bone.”\n\t•\tSevere subchondral sclerosis.\n\t•\tDefinite deformity of the bone ends.", "Clinical Correlation\n\t•\tSymptoms:\n\t•\tPatients frequently experience constant, severe joint pain.\n\t•\tMarked stiffness and significant functional impairment are common.\n\t•\tImplications:\n\t•\tThis stage represents advanced OA where structural damage is extensive and significantly affects daily activities.", "Management and Recommendations\n\t•\tAdvanced Treatments:\n\t•\tWhen conservative measures are no longer effective, joint replacement surgery (e.g., total knee arthroplasty) may be indicated.\n\t•\tMultidisciplinary Approach:\n\t•\tCombine pain management, physical therapy, and possibly surgical consultation to address the advanced disease.\n\t•\tPatient Counseling:\n\t•\tProvide thorough counseling on treatment options, risks, and expected outcomes.", "Conclusion\nKL Grade 4 is the most severe form of OA, characterized by extensive structural damage. At this stage, the focus shifts to advanced interventions to improve quality of life and alleviate debilitating symptoms.", "Document 7: Comprehensive Management and Future Directions for OA", "Overview\nBeyond radiographic classification, successful management of osteoarthritis (OA) involves a multifaceted approach combining lifestyle changes, medical interventions, and emerging therapies. This document outlines comprehensive management strategies and discusses future directions in OA care.", "Conservative Management\n\t•\tLifestyle Modifications:\n\t•\tWeight management, regular low-impact exercise (e.g., swimming, cycling), and dietary adjustments.\n\t•\tPhysical Therapy:\n\t•\tExercises to strengthen muscles around affected joints and improve flexibility.\n\t•\tPharmacologic Treatments:\n\t•\tNSAIDs and analgesics for pain relief.\n\t•\tIntra-articular injections (e.g., corticosteroids, hyaluronic acid) to reduce inflammation.", "Interventional and Surgical Options\n\t•\tSurgical Interventions:\n\t•\tFor severe OA (KL Grade 4), joint replacement surgery may be the best option.\n\t•\tEmerging Therapies:\n\t•\tResearch into regenerative medicine (e.g., stem cell therapy) and biologics holds promise for repairing damaged joint tissues.", "Integration of Technology in OA Management\n\t•\tAI and Machine Learning:\n\t•\tUse predictive models to assess OA risk and progression.\n\t•\tImplement retrieval‑augmented generation (RAG) to provide patients with personalized information, using domain‑specific documents (clinical guidelines, research articles) to support decision‑making.\n\t•\tTelemedicine and Digital Monitoring:\n\t•\tIntegrate wearable devices and remote monitoring to track patient activity and pain levels, thereby personalizing treatment plans.", "Patient Education and Self‑Management\n\t•\tEducational Materials:\n\t•\tProvide comprehensive educational resources that explain OA, its progression, and management strategies.\n\t•\tInteractive Tools:\n\t•\tDevelop mobile apps or chatbots to guide patients through exercise regimens, medication schedules, and self‑care practices.", "Future Directions in OA Care\n\t•\tPrecision Medicine:\n\t•\tAdvances in genomics and biomarkers may allow for more targeted therapies.\n\t•\tData Integration:\n\t•\tIntegration of electronic health records (EHR) with predictive AI models can enhance early detection and personalized treatment plans.\n\t•\tResearch and Clinical Trials:\n\t•\tOngoing studies in regenerative therapies and novel pain management approaches are paving the way for improved outcomes.", "Conclusion\nThis document provides a comprehensive look at the current state of OA management and highlights future directions that may further improve patient care. By combining established treatments with innovative technologies like AI, clinicians can better manage OA and enhance quality of life for patients.", "These seven documents should serve as a robust, detailed set of resources on osteoarthritis—covering both the specific radiographic KL grades and broader management topics. They can be used for retrieval-augmented generation (RAG) in your project to help answer domain-specific queries with high-quality, evidence-based information."]